""[0-9a-z]\+\zs\s\+'
"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
"""""""""""""""""色々やりたい事メモ
"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
"""英語のhelpを使うようにする
"""%の移動キー設定を変更しておきたい
"""GVIMをSSHクライアントにしてみたい(netrwで出来るかも)
"""popupが出たらpopup対象のコメントを見れるようにしたり出来ないかな
"""非同期実行
"""自動更新
"dbext環境設定
"let g:dbext_default_profile_*** = 'type=PGSQL:user=postgres:passwd=***:dbname=***:host=localhost:port=5432:bin_path=/usr/local/pgsql/bin'
"-----------------------------------------------------------------------------
"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
"""""""""""""""""言語毎の設定
"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
"""""""""""""""""VIMRCの自動読み込み
"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
"augroup MyAutoCmd
"  " HTMLとXMLの閉じタグを自動補完
"  autocmd BufNewFile,BufRead *.ctp inoremap <buffer> </ </<C-x><C-o>
"  autocmd Filetype xml  inoremap <buffer> </ </<C-x><C-o>
"  autocmd Filetype html inoremap <buffer> </ </<C-x><C-o>
"augroup END
"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
"""""""""""""""""TODO
"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
"Win用設定
if has('win32') || has('win64')
  let g:netrw_cygwin = 0
  let g:netrw_ssh_cmd  = '"C:\xxxxxxxxxxxx\PuTTY\plink.exe" -batch -T -ssh'
  let g:netrw_scp_cmd  = '"C:\xxxxxxxxxxxx\PuTTY\pscp.exe"  -batch -q -scp'
  let g:netrw_sftp_cmd = '"C:\xxxxxxxxxxxx\PuTTY\pscp.exe"  -batch -q -sftp'
else
endif
